LLBYYDS/STM32F103-Template/Core/Src/freertos.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * File Name          : freertos.c
  * Description        : Code for freertos applications
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "FreeRTOS.h"
#include "task.h"
#include "main.h"
#include "cmsis_os.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32f1xx_hal.h"
#include "GUI.h"
#include "usart.h"
#include "led.h"
#include "key.h"
#include "beep.h"
#include "at24c02.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
/* USER CODE BEGIN Variables */

/* USER CODE END Variables */
osThreadId LED_TASKHandle;
osThreadId UI_TaskHandle;
osThreadId UI_Touch_TaskHandle;

/* Private function prototypes -----------------------------------------------*/
/* USER CODE BEGIN FunctionPrototypes */

/* USER CODE END FunctionPrototypes */

void LED_Func(void const * argument);
void UI_Func(void const * argument);
void Touch_Func(void const * argument);

void MX_FREERTOS_Init(void); /* (MISRA C 2004 rule 8.1) */

/* GetIdleTaskMemory prototype (linked to static allocation support) */
void vApplicationGetIdleTaskMemory( StaticTask_t **ppxIdleTaskTCBBuffer, StackType_t **ppxIdleTaskStackBuffer, uint32_t *pulIdleTaskStackSize );

/* USER CODE BEGIN GET_IDLE_TASK_MEMORY */
static StaticTask_t xIdleTaskTCBBuffer;
static StackType_t xIdleStack[configMINIMAL_STACK_SIZE];

void vApplicationGetIdleTaskMemory( StaticTask_t **ppxIdleTaskTCBBuffer, StackType_t **ppxIdleTaskStackBuffer, uint32_t *pulIdleTaskStackSize )
{
  *ppxIdleTaskTCBBuffer = &xIdleTaskTCBBuffer;
  *ppxIdleTaskStackBuffer = &xIdleStack[0];
  *pulIdleTaskStackSize = configMINIMAL_STACK_SIZE;
  /* place for user code */
}
/* USER CODE END GET_IDLE_TASK_MEMORY */

/**
  * @brief  FreeRTOS initialization
  * @param  None
  * @retval None
  */
void MX_FREERTOS_Init(void) {
  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* USER CODE BEGIN RTOS_MUTEX */
  /* add mutexes, ... */
  /* USER CODE END RTOS_MUTEX */

  /* USER CODE BEGIN RTOS_SEMAPHORES */
  /* add semaphores, ... */
  /* USER CODE END RTOS_SEMAPHORES */

  /* USER CODE BEGIN RTOS_TIMERS */
  /* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

  /* USER CODE BEGIN RTOS_QUEUES */
  /* add queues, ... */
  /* USER CODE END RTOS_QUEUES */

  /* Create the thread(s) */
  /* definition and creation of LED_TASK */
  osThreadDef(LED_TASK, LED_Func, osPriorityIdle, 0, 1024);
  LED_TASKHandle = osThreadCreate(osThread(LED_TASK), NULL);

  /* definition and creation of UI_Task */
  osThreadDef(UI_Task, UI_Func, osPriorityNormal, 0, 1024);
  UI_TaskHandle = osThreadCreate(osThread(UI_Task), NULL);

  /* definition and creation of UI_Touch_Task */
  osThreadDef(UI_Touch_Task, Touch_Func, osPriorityNormal, 0, 1024);
  UI_Touch_TaskHandle = osThreadCreate(osThread(UI_Touch_Task), NULL);

  /* USER CODE BEGIN RTOS_THREADS */
  /* add threads, ... */
  /* USER CODE END RTOS_THREADS */

}

/* USER CODE BEGIN Header_LED_Func */
/**
  * @brief  Function implementing the LED_TASK thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_LED_Func */
void LED_Func(void const * argument)
{
  /* USER CODE BEGIN LED_Func */
  /* Infinite loop */
   uint8_t wData[15] = "Hello AT24C02!";
   uint8_t rData[15] = {0};
  for(;;)
  {
      KEY_Process();
      Key_Event key = KEY_GetEvent(KEY_WK_UP);
      if(KEY_EVENT_SHORT_PRESS == key)
      {
        AT24C02_WriteMultiBytes(0x00, wData, sizeof(wData));
        printf("Write OK!\r\n");
      }

      key = KEY_GetEvent(KEY_1);
      if(KEY_EVENT_SHORT_PRESS == key)
      {
        AT24C02_ReadMultiBytes(0x00, rData, sizeof(rData));
        printf("Read Data:%s\r\n", rData);
      }

      osDelay(KEY_SCAN_INTERVAL);
  }
  /* USER CODE END LED_Func */
}

/* USER CODE BEGIN Header_UI_Func */
/**
* @brief Function implementing the UI_Task thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_UI_Func */
void UI_Func(void const * argument)
{
  /* USER CODE BEGIN UI_Func */
  GUI_Init();
  GUI_SetBkColor(GUI_BLACK);
  GUI_Clear();
  GUI_CURSOR_Show();
  /* Infinite loop */
  for(;;)
  {
      GUI_Exec();
      osDelay(5);
  }
  /* USER CODE END UI_Func */
}

/* USER CODE BEGIN Header_Touch_Func */
/**
* @brief Function implementing the UI_Touch_Task thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_Touch_Func */
void Touch_Func(void const * argument)
{
  /* USER CODE BEGIN Touch_Func */
  /* Infinite loop */
  for(;;)
  {
      GUI_TOUCH_Exec();
      osDelay(5);
  }
  /* USER CODE END Touch_Func */
}

/* Private application code --------------------------------------------------*/
/* USER CODE BEGIN Application */

/* USER CODE END Application */

